"""
Реализовать скрипт, в котором должна быть предусмотрена функция расчёта заработной платы сотрудника. Используйте в нём
формулу: (выработка в часах*ставка в час) + премия. Во время выполнения расчёта для конкретных значений необходимо
запускать скрипт с параметрами.
"""
import sys

time, rate_hour, bonus = sys.argv[1:]
try:
    res = int(time) * int(rate_hour) + int(bonus)
    print(f'Заработная плата сотрудника {res:0,} руб.'.replace(',', ' '))
except ValueError:
    print('Один или более аргументов не число')

# python task_4_1.py 40 1700 100000
